Updateed processing logic
